ИС_СПОРТ_2022/src/Reports/СписокСпортсменов/СписокСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СписокСпортсменов</name>
</mdclass:Report>

ИС_СПОРТ_2022/src/InformationRegisters/ПодтвержденныеРазрядыСпортсменов/ПодтвержденныеРазрядыСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодтвержденныеРазрядыСпортсменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПодтверждающегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждающегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядУдалить</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Documents/ЗачислениеСпортсменовНаЭтап/ЗачислениеСпортсменовНаЭтап.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачислениеСпортсменовНаЭтап</name>
  <registerRecords>AccumulationRegister.КоличествоВидовСпортаТренеров</registerRecords>
  <registerRecords>InformationRegister.ЭтапыСпортивнойПодготовкиСпортсменов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпортивнаяПрограмма</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РезультатыСдачиКонтрольноПереводныхНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Catalogs/УчебныйГод/УчебныйГод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныйГод</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Reports/СписокСпортсменов/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетНаСервере(Результат);
	
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(ТабДок)

	ТабДок.Очистить();
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	ОСКД = ОбъектОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию;
	ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
			
	ДокументТекущегоУчебногоГода = УчетСпортсменовСервер.ПолучитьДокументТекущегоУчебногоГода();
	
	//{Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.20 
	
	Если Спортсмены.Количество()>0 Тогда
		ЭлементСпортсмены = НастройкиОСКД.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементСпортсмены.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Спортсмен");
		ЭлементСпортсмены.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементСпортсмены.ПравоеЗначение = Спортсмены;
		ЭлементСпортсмены.Использование = Истина;
		
		ГодНачала = Формат(Год(ДокументТекущегоУчебногоГода.УчебныйГод.ДатаНачала),"ЧГ=0");
		МесяцНачала = Месяц(ДокументТекущегоУчебногоГода.УчебныйГод.ДатаНачала);
		ДеньНачала = День(ДокументТекущегоУчебногоГода.УчебныйГод.ДатаНачала);
		
		ГодКонца = Формат(Год(ДокументТекущегоУчебногоГода.УчебныйГод.ДатаОкончания),"ЧГ=0");
		МесяцКонца = Месяц(ДокументТекущегоУчебногоГода.УчебныйГод.ДатаОкончания);
		ДеньКонца = День(ДокументТекущегоУчебногоГода.УчебныйГод.ДатаОкончания);
		
		ОСКД.НаборыДанных.Данные.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АВТОНОМЕРЗАПИСИ() КАК Номер,
			|	ЗачислениеСпортсменовНаЭтапСпортсмены.Спортсмен.Ссылка КАК Спортсмен,
			|	ЗачислениеСпортсменовНаЭтапСпортсмены.Спортсмен.ФизическоеЛицо.ГодРождения КАК ГодРождения
			|ПОМЕСТИТЬ Спортсмены
			|ИЗ
			|	Документ.ЗачислениеСпортсменовНаЭтап.Спортсмены КАК ЗачислениеСпортсменовНаЭтапСпортсмены
			|ГДЕ
			|	ЗачислениеСпортсменовНаЭтапСпортсмены.Ссылка.ДатаЗачисления МЕЖДУ ДАТАВРЕМЯ("+ГодНачала+","+МесяцНачала+","+ДеньНачала+",0,0,0) И ДАТАВРЕМЯ("+ГодКонца+","+МесяцКонца+","+ДеньКонца+",0,0,0)
			|	И ЗачислениеСпортсменовНаЭтапСпортсмены.Ссылка.Проведен = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗачислениеСпортсменовНаЭтапСпортсмены.Спортсмен.Ссылка,
			|	ЗачислениеСпортсменовНаЭтапСпортсмены.Спортсмен.ФизическоеЛицо.ГодРождения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Спортсмены.Номер КАК Номер,
			|	Спортсмены.Спортсмен КАК Спортсмен,
			|	Спортсмены.ГодРождения КАК ГодРождения,
			|	ЕСТЬNULL(ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд, ""б/р"") КАК Разряд
			|ИЗ
			|	Спортсмены КАК Спортсмены
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
			|		ПО Спортсмены.Спортсмен.Ссылка = ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Спортсмены.ГодРождения,
			|	ЕСТЬNULL(ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд, ""б/р""),
			|	Спортсмены.Спортсмен,
			|	Спортсмены.Номер";
	Иначе
		
		ЭлементНачалоПериода = ПараметрыДанныхОСКД.Найти("УчебныйГод");
		ЭлементНачалоПериода.Использование = Истина;
		ЭлементНачалоПериода.Значение = ?(НЕ ДокументТекущегоУчебногоГода.Пустая(), ДокументТекущегоУчебногоГода.УчебныйГод, Справочники.УчебныйГод.ПустаяСсылка());
		
	КонецЕсли;
	//}Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.20
	
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиКомпоновкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных;
	Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД, ДанныеРасшифровкиКомпоновкиДанных);

	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет,, ДанныеРасшифровкиКомпоновкиДанных);

	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабДок);
	ПроцессорВыводаОСКД.НачатьВывод();
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	

КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Данные = ТабДокОбработкаРасшифровкиНаСервере(Расшифровка);
	ОткрытьЗначение(Данные);
	
КонецПроцедуры

&НаСервере
Функция ТабДокОбработкаРасшифровкиНаСервере(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);

	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") тогда
		ЭлементРасшифровки = Данные.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для Каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
				Возврат Поле.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	//{Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.20
	Если Параметры.Свойство("Спортсмены") Тогда
		Спортсмены = Параметры.Спортсмены;
	КонецЕсли;
	//}Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.20
КонецПроцедуры
